renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
/******************************************************************************
* Function Name: r_ssi_clear_flag_tde
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_tde)
void r_ssi_clear_flag_tde ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssifsr = p_ssi_reg->SSIFSR.LONG;  /* get SSIFSR */

    ssifsr &= (~SSIE_BIT_TDE);                 /* clear TDE to 0 */
    p_ssi_reg->SSIFSR.LONG = ssifsr;           /* update SSIFSR */
} /* End of Function r_ssi_clear_flag_tde */

/******************************************************************************
* Function Name: r_ssi_clear_flag_rdf
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_rdf)
void r_ssi_clear_flag_rdf ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssifsr = p_ssi_reg->SSIFSR.LONG;  /* get SSIFSR */

    ssifsr &= (~SSIE_BIT_RDF);                 /* clear RDF to 0 */
    p_ssi_reg->SSIFSR.LONG = ssifsr;           /* update SSIFSR */
} /* End of Function r_ssi_clear_flag_rdf */

/******************************************************************************
* Function Name: r_ssi_clear_flag_tuirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_tuirq)
void r_ssi_clear_flag_tuirq ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSIE_BIT_TUIRQ);              /* clear TUIRQ to 0 */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_tuirq */

/******************************************************************************
* Function Name: r_ssi_clear_flag_toirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_toirq)
void r_ssi_clear_flag_toirq ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSIE_BIT_TOIRQ);              /* clear TOIRQ to 0 */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_toirq */

/******************************************************************************
* Function Name: r_ssi_clear_flag_ruirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_ruirq)
void r_ssi_clear_flag_ruirq ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSIE_BIT_RUIRQ);              /* clear RUIRQ to 0 */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_ruirq */

/******************************************************************************
* Function Name: r_ssi_clear_flag_roirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_roirq)
void r_ssi_clear_flag_roirq ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSIE_BIT_ROIRQ);              /* clear ROIRQ to 0 */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_roirq */

/******************************************************************************
* Function Name: r_ssi_module_stop
* Description  : 
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
*                ssi_mstp : activate or deactivate module stop
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_module_stop)
void r_ssi_module_stop (const ssi_ch_t Channel, const ssi_mstp_t ssi_mstp)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
	bsp_int_ctrl_t int_ctrl;
#endif

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    switch (Channel)
    {
        case SSI_CH0:
            MSTP(SSIE0) = ssi_mstp;
        break;

#ifdef SSIE1 /* activates when using MCU with SSIE1 */
        case SSI_CH1:
            MSTP(SSIE1) = ssi_mstp;
        break;
#endif
        default:
            ; /* no operation */
        break;
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of Function  */

/******************************************************************************
* Function Name: r_ssi_check_param
* Description  : 
* Arguments    : const ssi_ch_t Channel     : [I] Channel Number of SSI
* Return Value : return value defined in enum ssi_ret_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_check_param)
ssi_ret_t r_ssi_check_param (const ssi_ch_t Channel)
{
    ssi_ret_t ret = SSI_SUCCESS;

    switch (Channel)
    {
        case SSI_CH0:
            if (true == R_BSP_HardwareLock(BSP_LOCK_SSIE0))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSIE0);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSIE1 /* activates when using MCU with SSIE1 */
        case SSI_CH1:
            if (true == R_BSP_HardwareLock(BSP_LOCK_SSIE1))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSIE1);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    return ret;
} /* End of Function r_ssi_check_param */

