renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
/******************************************************************************
* Function Name: r_ssi_check_param_buf
* Description  : 
* Arguments    : const ssi_ch_t Channel     : [I] Channel Number of SSI
*              : const void * pBuf          : [I/O] Pointer to Output Buffer
*              : const uint8_t Samples      : [I] Number of samples to write 
* Return Value : return value defined in enum ssi_ret_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_check_param_buf)
ssi_ret_t r_ssi_check_param_buf (const ssi_ch_t Channel,
                                 const  void * pBuf,
                                 const  uint8_t Samples)
{
    ssi_ret_t ret = SSI_SUCCESS;

    switch (Channel)
    {
        case SSI_CH0:
            if (((uint32_t *)FIT_NO_PTR == pBuf) || (0 == Samples))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSIE0))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSIE0);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSIE1 /* activates when using MCU with SSIE1 */
        case SSI_CH1:
            if (((uint32_t *)FIT_NO_PTR == pBuf) || (0 == Samples))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSIE1))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSIE1);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    return ret;
} /* End of Function r_ssi_check_param_buf */

/******************************************************************************
* Function Name: r_ssi_check_param_mute
* Description  : 
* Arguments    : const ssi_ch_t Channel      : [I] Channel Number of SSI
*              : const ssi_mute_t OnOff      : [I] Mute ON/OFF Switch
* Return Value : return value defined in enum ssi_ret_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_check_param_mute)
ssi_ret_t r_ssi_check_param_mute (const ssi_ch_t Channel,
                                  const  ssi_mute_t OnOff)
{
    ssi_ret_t ret = SSI_SUCCESS;

    switch (Channel)
    {
        case SSI_CH0:

            /* The following code occurs a compilation warning but does not affect actual operation. */
            if ((SSI_MUTE_ON > OnOff) || (SSI_MUTE_OFF < OnOff))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSIE0))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSIE0);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSIE1 /* activates when using MCU with SSIE1 */
        case SSI_CH1:

            /* The following code occurs a compilation warning but does not affect actual operation. */
            if ((SSI_MUTE_ON > OnOff) || (SSI_MUTE_OFF < OnOff))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSIE1))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSIE1);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    return ret;
} /* End of Function r_ssi_check_param_mute */

/******************************************************************************
* Function Name: r_ssi_get_word_num_per_sample
* Description  :
* Arguments    : p_ssi_reg: SSIE0 or SSIE1 io register address
* Return Value : uint8_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_get_word_num_per_sample)
uint8_t r_ssi_get_word_num_per_sample ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg )
{
    uint8_t word_num_per_sample = 0;
    uint8_t omod = p_ssi_reg->SSIOFR.BIT.OMOD;
    uint8_t frm = p_ssi_reg->SSICR.BIT.FRM;

    if ((2 == omod) && (0 == frm))
    {
        /* Monaural */
        word_num_per_sample = 1;
    }
    else if ((1 == omod) && (1 == frm))
    {
        /* TDM 4words */
        word_num_per_sample = 4;
    }
    else if ((1 == omod) && (2 == frm))
    {
        /* TDM 6words */
        word_num_per_sample = 6;
    }
    else if ((1 == omod) && (3 == frm))
    {
        /* TDM 8words */
        word_num_per_sample = 8;
    }
    else if ((0 == omod) && (0 == frm))
    {
        /* I2S, Left-justified, Right-justified */
        word_num_per_sample = 2;
    }
    else {
        word_num_per_sample = 0;
    }

    return word_num_per_sample;

} /* End of Function r_ssi_get_word_num_per_sample */

/******************************************************************************
* Function Name: r_ssi_write_zero_to_tx_fifo
* Description  : Write 0 to Tx FIFO
* Arguments    : p_ssi_reg    :SSIE0 or SSIE1 io register address
*              : write_count  :write count
* Return Value :
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_write_zero_to_tx_fifo)
void r_ssi_write_zero_to_tx_fifo ( volatile struct st_ssie R_SSIE_EVENACCESS * p_ssi_reg, int32_t write_count )
{
	while(0 < write_count)
    {
        if (SSIE_SSICR_DWL08 == p_ssi_reg->SSICR.BIT.DWL)
        {
            p_ssi_reg->SSIFTDR.BYTE.HH = 0u;
        }
        else if (SSIE_SSICR_DWL16 == p_ssi_reg->SSICR.BIT.DWL)
        {
            p_ssi_reg->SSIFTDR.WORD.H = 0u;
        }
        else
        {
            p_ssi_reg->SSIFTDR.LONG = 0u;
        }
        write_count --;
    }
}

/**********************************************************************************************************************
 * Function Name: R_SSI_Open
 ******************************************************************************************************************//**
 * @brief Locks to keep a specified SSI channel and initializes it corresponding to r_ssi_api_rx_config.h.
 * @param[in] Channel It specifies an SSI channel to lock. Choose one enumerator member from the enumerator typedef
 * ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, the specified SSI channel is configured.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel can't be locked.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function certainly once before starting to use a specified SSI channel individually.
 * @note -
 */
ssi_ret_t R_SSI_Open ( const ssi_ch_t Channel )
{
    uint32_t ssifcr;
    uint32_t ssiscr;
    uint32_t ssicr;
    uint32_t ssiofr;
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;
    uint32_t timeout;

