renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
    /* parameter check operation */
    switch (Channel)
    {
        case SSI_CH0:
            if (false == R_BSP_HardwareLock(BSP_LOCK_SSIE0))
            {
                return SSI_ERR_CHANNEL;
            }

            /* logical operation to make value to set ssi register  */
            ssicr = ((SSIE_CH0_DEL << SSIE_DEL_SHIFT) |
                     (SSIE_CH0_PDTA << SSIE_PDTA_SHIFT) |
                     (SSIE_CH0_SDTA << SSIE_SDTA_SHIFT) |
                     (SSIE_CH0_SPDP << SSIE_SPDP_SHIFT) |
                     (SSIE_CH0_LRCKP << SSIE_LRCKP_SHIFT) |
                     (SSIE_CH0_BCKP << SSIE_BCKP_SHIFT) |
                     (SSIE_CH0_MST << SSIE_MST_SHIFT) |
                     (SSIE_CH0_SWL << SSIE_SWL_SHIFT) |
                     (SSIE_CH0_DWL << SSIE_DWL_SHIFT) |
                     (SSIE_CH0_FRM << SSIE_FRM_SHIFT));
            ssifcr = (SSIE_CH0_BSW << SSIE_BSW_SHIFT);
            ssiscr = ((SSIE_CH0_TDES << SSIE_TDES_SHIFT) |
                      (SSIE_CH0_RDFS << SSIE_RDFS_SHIFT));
            ssiofr = (SSIE_CH0_OMOD << SSIE_OMOD_SHIFT);

            if (SSIE_SSICR_MST_ON == SSIE_CH0_MST)
            {
                ssicr  = (ssicr  | (SSIE_CH0_CKDV << SSIE_CKDV_SHIFT));
                ssifcr = (ssifcr | (SSIE_CH0_AUCKE << SSIE_AUCKE_SHIFT));
                ssiofr = (ssiofr | (SSIE_BCKASTP_ON << SSIE_BCKASTP_SHIFT));
            }

            p_ssi_reg = &(SSIE0);
        break;

#ifdef SSIE1 /* activates when using MCU with SSIE1 */
        case SSI_CH1:
            if (false == R_BSP_HardwareLock(BSP_LOCK_SSIE1))
            {
                return SSI_ERR_CHANNEL;
            }

            /* logical operation to make value to set ssi register  */
            ssicr = ((SSIE_CH1_DEL << SSIE_DEL_SHIFT) |
                     (SSIE_CH1_PDTA << SSIE_PDTA_SHIFT) |
                     (SSIE_CH1_SDTA << SSIE_SDTA_SHIFT) |
                     (SSIE_CH1_SPDP << SSIE_SPDP_SHIFT) |
                     (SSIE_CH1_LRCKP << SSIE_LRCKP_SHIFT) |
                     (SSIE_CH1_BCKP << SSIE_BCKP_SHIFT) |
                     (SSIE_CH1_MST << SSIE_MST_SHIFT) |
                     (SSIE_CH1_SWL << SSIE_SWL_SHIFT) |
                     (SSIE_CH1_DWL << SSIE_DWL_SHIFT) |
                     (SSIE_CH1_FRM << SSIE_FRM_SHIFT));
            ssifcr = (SSIE_CH1_BSW << SSIE_BSW_SHIFT);
            ssiscr = ((SSIE_CH1_TDES << SSIE_TDES_SHIFT) |
                      (SSIE_CH1_RDFS << SSIE_RDFS_SHIFT));
            ssiofr = (SSIE_CH1_OMOD << SSIE_OMOD_SHIFT);

            if (SSIE_SSICR_MST_ON == SSIE_CH1_MST)
            {
                ssicr  = (ssicr  | (SSIE_CH1_CKDV << SSIE_CKDV_SHIFT));
                ssifcr = (ssifcr | (SSIE_CH1_AUCKE << SSIE_AUCKE_SHIFT));
                ssiofr = (ssiofr | (SSIE_BCKASTP_ON << SSIE_BCKASTP_SHIFT));
            }

            p_ssi_reg = &(SSIE1);
        break;
#endif

        default:
            return SSI_ERR_PARAM;
    }

    /* Open operation mainbody */
    r_ssi_module_stop (Channel, SSIE_MSTP_CLR);

    /* reset SSI peripheral */
    p_ssi_reg->SSIFCR.BIT.SSIRST = SSIE_SSIFCR_SSIRST_ENABLE; /* sets SSIRST bit to "1" */
    p_ssi_reg->SSIFCR.BIT.SSIRST = SSIE_SSIFCR_SSIRST_DISABLE; /* clears SSIRST bit to "0" */

    timeout = SSIE_TIMEOUT_416USEC; /* initializes timeout counter. */
    /* WAIT_LOOP */
    while( SSIE_SSIFCR_SSIRST_DISABLE != p_ssi_reg->SSIFCR.BIT.SSIRST ) /* waits till SSIRST to be "0" */
    {
        /* Check loop count to detect abnormal condition. */
        timeout = r_ssi_down_count ( timeout );
        if ( 0 == timeout )
        {
            return SSI_ERR_EXCEPT; /* returns abnormal condition. */
        }
    }

    /* Set SSICR, SSIFCR, SSIOFR register */
    p_ssi_reg->SSICR.LONG  = 0u;
    p_ssi_reg->SSIFCR.LONG = 0u;
    p_ssi_reg->SSISCR.LONG = 0u;
    p_ssi_reg->SSIOFR.LONG = 0u;

    /* Set SSICR, SSIFCR, SSIOFR register */
    p_ssi_reg->SSICR.LONG  |= ssicr;
    p_ssi_reg->SSIFCR.LONG |= ssifcr;
    p_ssi_reg->SSISCR.LONG |= ssiscr;
    p_ssi_reg->SSIOFR.LONG |= ssiofr;

    return SSI_SUCCESS;
}

/******************************************************************************
End of function  R_SSI_Open
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Start
 ******************************************************************************************************************//**
 * @brief Enables PCM data transmit and/or receive operations for a specified SSI channel.
 * @param[in] Channel It specifies an SSI channel to enable PCM data transmit and/or receive operations. Choose one
 * enumerator member from the enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, PCM data transmit and/or receive operations are enabled for the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to enable PCM data transmit and/or receive operation with a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_Start ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;
    uint32_t dummy;         /* valiable for dummy reading to write SSIFSR, SSISR. */
    uint32_t timeout;
    uint8_t word_num_per_sample;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);
    if (SSI_SUCCESS != ret)  /* parameters are valid. */
    {
        return ret;
    }

    /* getting ssi register address */
    p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

    /* SSIE operation state confirmation, is it Idle state? */
    timeout = SSIE_TIMEOUT_416USEC;
    /* WAIT_LOOP */
    while ( SSIE_SSISR_IIRQ_OFF == p_ssi_reg->SSISR.BIT.IIRQ )
    {
        /* Check loop count to detect abnormal condition. */
        timeout = r_ssi_down_count ( timeout );
        if ( 0 == timeout )
        {
            return SSI_ERR_EXCEPT; /* returns abnormal condition. */
        }
    }

