renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
    word_num_per_sample = r_ssi_get_word_num_per_sample(p_ssi_reg);

    /* SSI Start operation */
    switch (r_ssi_get_iomode [Channel])
    {
        case SSIE_IO_MODE_TX: /* case SSI transmit mode */
            if (SSIE_SSICR_TEN_DISABLE != p_ssi_reg->SSICR.BIT.TEN)
            {
                return SSI_ERR_EXCEPT;
            }

            /* Tx FIFO Reset */
            p_ssi_reg->SSIFCR.BIT.TFRST = SSIE_SSIFCR_TFRST_ENABLE;
            p_ssi_reg->SSIFCR.BIT.TFRST = SSIE_SSIFCR_TFRST_DISABLE;

            timeout = SSIE_TIMEOUT_416USEC; /* initializes timeout counter. */
            /* WAIT_LOOP */
            while( SSIE_SSIFCR_TFRST_DISABLE != p_ssi_reg->SSIFCR.BIT.TFRST ) /* waits till TFRST to be "0" */
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    return SSI_ERR_EXCEPT; /* returns abnormal condition. */
                }
            }

            /* Write 0 to Tx FIFO */
            if(6 == word_num_per_sample)
            {
	            r_ssi_write_zero_to_tx_fifo(p_ssi_reg, 30);
	        }
	        else
	        {
	            r_ssi_write_zero_to_tx_fifo(p_ssi_reg, SSIE_SSIFSR_TDCMAX);
	        }

            /* SSIFSR, SSISR Initialize */
            dummy = p_ssi_reg->SSIFSR.LONG;       /* dummy reading is needed to write SSIFSR. */
            p_ssi_reg->SSIFSR.LONG = 0u;
            dummy = p_ssi_reg->SSISR.LONG;        /* dummy reading is needed to write SSISR. */
            p_ssi_reg->SSISR.LONG = 0u;
            dummy; /* This code occurs a compilation warning but does not affect actual operation. */

            /* Setting to start SSI Tx */
            p_ssi_reg->SSIFCR.BIT.TIE = SSIE_SSIFCR_TIE_ENABLE;
            p_ssi_reg->SSICR.LONG |= ((SSIE_SSICR_TUIEN_ENABLE << SSIE_TUIEN_SHIFT) |
                                      (SSIE_SSICR_TOIEN_ENABLE << SSIE_TOIEN_SHIFT) |
                                      (SSIE_SSICR_TEN_ENABLE << SSIE_TEN_SHIFT));
        break;

        case SSIE_IO_MODE_RX: /* case SSI receive mode */
            if (SSIE_SSICR_REN_DISABLE != p_ssi_reg->SSICR.BIT.REN)
            {
                return SSI_ERR_EXCEPT;
            }

            /* Rx FIFO Reset */
            p_ssi_reg->SSIFCR.BIT.RFRST = SSIE_SSIFCR_RFRST_ENABLE;
            p_ssi_reg->SSIFCR.BIT.RFRST = SSIE_SSIFCR_RFRST_DISABLE;

            timeout = SSIE_TIMEOUT_416USEC; /* initializes timeout counter. */
            /* WAIT_LOOP */
            while( SSIE_SSIFCR_RFRST_DISABLE != p_ssi_reg->SSIFCR.BIT.RFRST ) /* waits till RFRST to be "0" */
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    return SSI_ERR_EXCEPT; /* returns abnormal condition. */
                }
            }

            /* SSIFSR, SSISR Initialize */
            dummy = p_ssi_reg->SSIFSR.LONG;       /* dummy reading is needed to write SSIFSR. */
            p_ssi_reg->SSIFSR.LONG = 0u;
            dummy = p_ssi_reg->SSISR.LONG;        /* dummy read is needed to write SSISR. */
            p_ssi_reg->SSISR.LONG = 0u;
            dummy; /* This code occurs a compilation warning but does not affect actual operation. */

            /* Setting to start SSI Rx */
            p_ssi_reg->SSIFCR.BIT.RIE = SSIE_SSIFCR_RIE_ENABLE;
            p_ssi_reg->SSICR.LONG |= ((SSIE_SSICR_RUIEN_ENABLE << SSIE_RUIEN_SHIFT) |
                                      (SSIE_SSICR_ROIEN_ENABLE << SSIE_ROIEN_SHIFT) |
                                      (SSIE_SSICR_REN_ENABLE));
        break;

        case SSIE_IO_MODE_TR: /* case SSI transmit & receive mode */
            if (SSIE_IO_MODE_NONE != (p_ssi_reg->SSICR.LONG & SSIE_IO_MODE_TR))
            {
                return SSI_ERR_EXCEPT;
            }

            /* Tx FIFO, Rx FIFO Reset */
            p_ssi_reg->SSIFCR.LONG |= ((SSIE_SSIFCR_TFRST_ENABLE << SSIE_TFRST_SHIFT) |
                                       (SSIE_SSIFCR_RFRST_ENABLE));
            p_ssi_reg->SSIFCR.LONG &= ~((SSIE_SSIFCR_TFRST_ENABLE << SSIE_TFRST_SHIFT) |
                                        (SSIE_SSIFCR_RFRST_ENABLE));

            timeout = SSIE_TIMEOUT_416USEC; /* initializes timeout counter. */

            /* WAIT_LOOP */
            while( SSIE_SSIFCR_TFRST_DISABLE != p_ssi_reg->SSIFCR.BIT.TFRST ) /* waits till TFRST to be "0" */
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    return SSI_ERR_EXCEPT; /* returns abnormal condition. */
                }
            }

            timeout = SSIE_TIMEOUT_416USEC; /* initializes timeout counter. */

            /* WAIT_LOOP */
            while( SSIE_SSIFCR_RFRST_DISABLE != p_ssi_reg->SSIFCR.BIT.RFRST ) /* waits till RFRST to be "0" */
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    return SSI_ERR_EXCEPT; /* returns abnormal condition. */
                }
            }

            /* Write 0 to Tx FIFO */
            if(6 == word_num_per_sample)
            {
	            r_ssi_write_zero_to_tx_fifo(p_ssi_reg, 30);
	        }
	        else
	        {
	            r_ssi_write_zero_to_tx_fifo(p_ssi_reg, SSIE_SSIFSR_TDCMAX);
	        }

            /* SSIFSR, SSISR clear to "0". */
            dummy = p_ssi_reg->SSIFSR.LONG;       /* dummy reading is needed to write SSIFSR. */
            p_ssi_reg->SSIFSR.LONG = 0u;
            dummy = p_ssi_reg->SSISR.LONG;        /* dummy reading is needed to write SSISR. */
            p_ssi_reg->SSISR.LONG = 0u;
            dummy; /* This code occurs a compilation warning but does not affect actual operation. */

            /* Setting to start SSI Tx, Rx */
            p_ssi_reg->SSIFCR.LONG |= ((SSIE_SSIFCR_TIE_ENABLE << SSIE_TIE_SHIFT) |
                                       (SSIE_SSIFCR_RIE_ENABLE << SSIE_RIE_SHIFT));
            p_ssi_reg->SSICR.LONG |= ((SSIE_SSICR_TUIEN_ENABLE << SSIE_TUIEN_SHIFT) |
                                      (SSIE_SSICR_TOIEN_ENABLE << SSIE_TOIEN_SHIFT) |
                                      (SSIE_SSICR_RUIEN_ENABLE << SSIE_RUIEN_SHIFT) |
                                      (SSIE_SSICR_ROIEN_ENABLE << SSIE_ROIEN_SHIFT) |
                                      (SSIE_SSICR_TEN_ENABLE << SSIE_TEN_SHIFT) |
                                      (SSIE_SSICR_REN_ENABLE));
        break;

        default:
            return SSI_ERR_CHANNEL;
    }

    timeout = SSIE_TIMEOUT_416USEC;
    /* WAIT_LOOP */
    while ( SSIE_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ )
    {
        /* Check loop count to detect abnormal condition. */
        timeout = r_ssi_down_count ( timeout );
        if ( 0 == timeout )
        {
            return SSI_ERR_EXCEPT; /* returns abnormal condition. */
        }
    }

    return SSI_SUCCESS;
}
/******************************************************************************
End of function  R_SSI_Start
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Stop
 ******************************************************************************************************************//**
 * @brief Disables PCM data transmit and/or receive operations for a specified SSI channel.
 * @param[in] Channel It specifies an SSI channel to disable PCM data transmit and/or receive operations. Choose one
 * enumerator member from the enumerator typedef ssi_ch. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, PCM data transmit and/or receive operations are disabled for the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function to disable PCM data transmit and/or receive operation with a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_Stop(const ssi_ch_t Channel)
{
    ssi_ret_t ret = SSI_SUCCESS;
    uint32_t timeout;
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;
    uint8_t word_num_per_sample;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);
    if (SSI_SUCCESS != ret)  /* parameters are valid. */
    {
        return ret;
    }

    /* stop operation mainbody */
    /* getting ssi register address */
    p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

