renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
    /* SSIE operation state confirmation, is it Transfer state? */
    timeout = SSIE_TIMEOUT_416USEC;
    /* WAIT_LOOP */
    while ( SSIE_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ )
    {
        /* Check loop count to detect abnormal condition. */
        timeout = r_ssi_down_count ( timeout );
        if ( 0 == timeout )
        {
            return SSI_ERR_EXCEPT; /* returns abnormal condition. */
        }
    }

    word_num_per_sample = r_ssi_get_word_num_per_sample(p_ssi_reg);

    /* SSI Stop operation */
    switch (r_ssi_get_iomode [Channel])
    {
        case SSIE_IO_MODE_TX: /* case SSI transmit mode */
            if (SSIE_SSICR_TEN_ENABLE != p_ssi_reg->SSICR.BIT.TEN)
            {
                /* Exception Error */
                return SSI_ERR_EXCEPT;
            }

            /* procedure to disable SSI transmit operation. */
            p_ssi_reg->SSICR.LONG &= ~((SSIE_SSICR_TUIEN_ENABLE << SSIE_TUIEN_SHIFT) |
                                       (SSIE_SSICR_TOIEN_ENABLE << SSIE_TOIEN_SHIFT));
            p_ssi_reg->SSIFCR.BIT.TIE = SSIE_SSIFCR_TIE_DISABLE;

            /* WAIT_LOOP */
            while (p_ssi_reg->SSIFSR.BIT.TDC >= (SSIE_SSIFSR_TDCMAX -  word_num_per_sample))
            {
                /* Exception Check */
                if (SSIE_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ)
                {
                    /* Exception Error */
                    return SSI_ERR_EXCEPT;
                }
            }

            /* Write 0 to Tx FIFO */
            r_ssi_write_zero_to_tx_fifo(p_ssi_reg, (int32_t)word_num_per_sample);

            timeout = SSIE_TIMEOUT_416USEC;

            /* WAIT_LOOP */
            while (SSIE_SSISR_TUIRQ_OFF == p_ssi_reg->SSISR.BIT.TUIRQ)
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    /* Return from abnormal condition. */
                    return SSI_ERR_EXCEPT;
                }
            }

            /* disable SSI transmit operation  */
            p_ssi_reg->SSICR.BIT.TEN = SSIE_SSICR_TEN_DISABLE;
            r_ssi_clear_flag_tuirq( p_ssi_reg );
        break;

        case SSIE_IO_MODE_RX: /* case SSI receive mode */
            if (SSIE_SSICR_REN_ENABLE != p_ssi_reg->SSICR.BIT.REN)
            {
                /* Exception Error */
                return SSI_ERR_EXCEPT;
            }

            /* disable SSI receive operation. */
            p_ssi_reg->SSICR.LONG &= ~((SSIE_SSICR_RUIEN_ENABLE << SSIE_RUIEN_SHIFT) |
                                       (SSIE_SSICR_ROIEN_ENABLE << SSIE_ROIEN_SHIFT) |
                                       (SSIE_SSICR_REN_ENABLE));

            /* disable SSI receive operation  */
            p_ssi_reg->SSIFCR.BIT.RIE = SSIE_SSIFCR_RIE_DISABLE;
        break;

        case SSIE_IO_MODE_TR: /* case SSI transmit & receive mode */
            if (SSIE_IO_MODE_TR != (p_ssi_reg->SSICR.LONG & SSIE_IO_MODE_TR))
            {
                /* Exception Error */
                p_ssi_reg->SSICR.LONG &= ~((SSIE_SSICR_TEN_ENABLE << SSIE_TEN_SHIFT) |
                                           (SSIE_SSICR_REN_ENABLE)); /* execution order doesn't affect result */
                return SSI_ERR_EXCEPT;
            }

            /* Procedure to disable SSI transmit operation.
               Receive operation is disabled here.
            */
            p_ssi_reg->SSICR.LONG &= ~((SSIE_SSICR_TUIEN_ENABLE << SSIE_TUIEN_SHIFT) |
                                       (SSIE_SSICR_TOIEN_ENABLE << SSIE_TOIEN_SHIFT) |
                                       (SSIE_SSICR_RUIEN_ENABLE << SSIE_RUIEN_SHIFT) |
                                       (SSIE_SSICR_ROIEN_ENABLE << SSIE_ROIEN_SHIFT) |
                                       (SSIE_SSICR_REN_ENABLE));
            p_ssi_reg->SSIFCR.LONG &= ~((SSIE_SSIFCR_TIE_ENABLE << SSIE_TIE_SHIFT) |
                                        (SSIE_SSIFCR_RIE_ENABLE << SSIE_RIE_SHIFT));

            /* wait until Tx FIFO becomes the underflow */
            /* WAIT_LOOP */
            while (p_ssi_reg->SSIFSR.BIT.TDC >= (SSIE_SSIFSR_TDCMAX -  word_num_per_sample))
            {
                /* Exception Check */
                if (SSIE_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ)
                {
                    /* Exception Error */
                    return SSI_ERR_EXCEPT;
                }
            }

            /* Write 0 to Tx FIFO */
            r_ssi_write_zero_to_tx_fifo(p_ssi_reg, (int32_t)word_num_per_sample);

            timeout = SSIE_TIMEOUT_416USEC;

            /* WAIT_LOOP */
            while (SSIE_SSISR_TUIRQ_OFF == p_ssi_reg->SSISR.BIT.TUIRQ)
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    /* Return from abnormal condition. */
                    return SSI_ERR_EXCEPT;
                }
            }

            /* disable SSI transmit operation  */
            p_ssi_reg->SSICR.BIT.TEN = SSIE_SSICR_TEN_DISABLE;
            r_ssi_clear_flag_tuirq( p_ssi_reg );
        break;

        default:
            ret = SSI_ERR_CHANNEL;
        break;
    }

    /* Wait operation for IIRQ to be set. */
    if ( SSI_SUCCESS != ret )
    {
        return ret;
    }

    /* Wait until Idle mode Interrrupt status Flag to be set. */
    /* initialize timeout counter. */
    timeout = SSIE_TIMEOUT_416USEC;

    /* WAIT_LOOP */
    while ( SSIE_SSISR_IIRQ_OFF == p_ssi_reg->SSISR.BIT.IIRQ )
    {
        /* Check loop count to detect abnormal condition. */
        timeout = r_ssi_down_count ( timeout );
        if ( 0u == timeout )
        {
            /* Return from abnormal condition. */
            return SSI_ERR_EXCEPT;
        }
    }

   return SSI_SUCCESS;
}
/******************************************************************************
End of function  R_SSI_Stop
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Close
 ******************************************************************************************************************//**
 * @brief Unlocks to release a specified SSI channel.
 * @param[in] Channel It specifies an SSI channel to release. Choose one enumerator member from the enumerator typedef
 * ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, the specified SSI channel is released.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel can't be unlocked or has not been locked.
 * @details Call this function when finish to use a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_Close(const ssi_ch_t Channel)
{
    ssi_ret_t ret = SSI_SUCCESS;
    uint32_t timeout;
    uint32_t dummy;         /* valiable for dummy reading to write SSIFSR, SSISR. */
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);
    if (SSI_SUCCESS != ret)  /* parameters are valid. */
    {
        return ret;
    }

    /* getting ssi register address */
    p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

    timeout = SSIE_TIMEOUT_416USEC;

    /* WAIT_LOOP */
    while ( SSIE_SSISR_IIRQ_OFF == p_ssi_reg->SSISR.BIT.IIRQ )
    {
        /* Check loop count to detect abnormal condition. */
        timeout = r_ssi_down_count ( timeout );
        if ( 0 == timeout )
        {
            return SSI_ERR_EXCEPT; /* returns abnormal condition. */
        }
    }

    /*  'Set reset value to registers.
        'This operation sets AUCKE disabled.
        'Clear operation for FIFOs is not executed,
           because FIFOs are filled with "0" after R_SSI_Stop()
           operation at this moment. So that FIFO underflow &
           overflow will not be arisen.
    */
    /* turn registers to default value */
    p_ssi_reg->SSICR.LONG = 0u;
    p_ssi_reg->SSIFCR.LONG = 0u;
    p_ssi_reg->SSISCR.LONG = 0u;
    p_ssi_reg->SSIOFR.LONG = 0u;

    dummy = p_ssi_reg->SSIFSR.LONG;
    p_ssi_reg->SSIFSR.LONG = 0u;
    dummy = p_ssi_reg->SSISR.LONG;
    p_ssi_reg->SSISR.LONG = 0;
    dummy; /* This code occurs a compilation warning but does not affect actual operation. */

    /* Stop feeding clock to SSI peripheral to deactivate it. */
    r_ssi_module_stop (Channel, SSIE_MSTP_SET);

    switch (Channel)
    {

