renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
        /* release HW lock to close SSI driver. */
        case SSI_CH0:
            if (false == R_BSP_HardwareUnlock(BSP_LOCK_SSIE0)) /* Unlock to close SSI driver */
            {
                /* case Unlock failure */
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSIE1 /* activates when using MCU with SSIE1 */
        case SSI_CH1:
            if (false == R_BSP_HardwareUnlock(BSP_LOCK_SSIE1)) /* Unlock to close SSI driver */
            {
                /* case Unlock failure */
                ret = SSI_ERR_CHANNEL;
            }
        break;
#endif

        default:
            /* no operation */
        break;
    }

    return ret;
}
/******************************************************************************
End of function  R_SSI_Close
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Write
 ******************************************************************************************************************//**
 * @brief Writes PCM data to a specified SSI channel for transmit operation. For the operation, adequate amount of
 * buffer memory must be declared in user application software.
 * @param[in] Channel It specifies an SSI channel to write PCM data. Choose one enumerator member from the enumerator
 * typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @param[in] pBuf It specifies the beginning address of PCM buffer memory storing PCM data to writes to Transmit FIFO
 * Data Register.
 * @param[in] Samples It specifies the request number of PCM data samples to write to Transmit FIFO Data Register.
 * @return The number of written samples: Shows the number of PCM data samples written to Transmit FIFO Data
 * Register of a specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked. Or the SSI channel
 * is configured for receive operation.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function to write PCM data to a specified SSI channel's Transmit FIFO Data Register.
 * @note that R_SSI_Write() should be called repeatedly to write PCM data to the specified SSI channel during
 * transmit operation.
 */
int8_t R_SSI_Write( const ssi_ch_t Channel,
                    const  void * pBuf,
                    const  uint8_t Samples)
{
    int8_t ret = SSI_SUCCESS;
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;
    uint32_t fifo_free;     /* holds the number of free memory in Tx FIFO */
    uint32_t request;       /* holds the number of times to write-access by request.*/
    uint32_t limit;         /* holds the number of times to write-access to Tx FIFO. */
    uint32_t count = 0u;   /* The number of times Tx FIFO was accessed. */
    uint8_t word_num_per_sample;

    /* parameter check operation */
    ret = r_ssi_check_param_buf (Channel, pBuf, Samples);
    if (SSI_SUCCESS != ret)  /* parameters are valid. */
    {
        return ret;
    }

    /* write operation mainbody */
    /* SSI Write */
    if (SSIE_IO_MODE_RX == r_ssi_get_iomode [Channel])
    {
        return SSI_ERR_CHANNEL;
    }

    /* getting ssi register address */
    p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

    word_num_per_sample = r_ssi_get_word_num_per_sample(p_ssi_reg);

    /* Process to write PCM data to Tx FIFO */
    /* Calculate the number of free memory in Tx FIFO. */
    fifo_free = SSIE_SSIFSR_TDCMAX - p_ssi_reg->SSIFSR.BIT.TDC;
    if (0u == fifo_free)
    {
        /* return because Tx FIFO is full. */
        return 0u;
    }

    /* Calculate time to write-access just corresponding to the "Samples". */
    request = ((uint32_t)Samples) * ((uint32_t)word_num_per_sample);

    /* Limit operation for times to write-accecss to Tx FIFO. */
    if (fifo_free <= request)
    {
        /* case, the number of free memory of Tx FIFO is larger than request. */
        limit = fifo_free;
    }
    else
    {
        /* case, the number of free memory of Tx FIFO is smaller than request. */
        limit = request;
    }

    limit = limit - (limit % word_num_per_sample);

    /* WAIT_LOOP */
    while (limit > count)
    {
        if (SSIE_SSICR_DWL08 == p_ssi_reg->SSICR.BIT.DWL)
        {
            p_ssi_reg->SSIFTDR.BYTE.HH = *((const uint8_t *)pBuf);
            pBuf = ((const uint8_t *)pBuf) + 1u;
        }
        else if (SSIE_SSICR_DWL16 == p_ssi_reg->SSICR.BIT.DWL)
        {
            p_ssi_reg->SSIFTDR.WORD.H = *((const uint16_t *)pBuf);
            pBuf = ((const uint16_t *)pBuf) + 1u;
        }
        else
        {
            p_ssi_reg->SSIFTDR.LONG = *((const uint32_t *)pBuf);
            pBuf = ((const uint32_t *)pBuf) + 1u;
        }

        count++;
    }

    /* Clear Tx FIFO empty flag */
    r_ssi_clear_flag_tde( p_ssi_reg );

    /* Convert the number of FIFO to be plactically written
         in Tx FIFO into the number of Samples */
    ret = (int8_t)(count / word_num_per_sample);

    return ret;
}
/******************************************************************************
End of function  R_SSI_Write
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Read
 ******************************************************************************************************************//**
 * @brief Reads PCM data from a specified SSI channel for receive operation. For the operation, adequate amount of
 * buffer memory must be declared in user application software.
 * @param[in] Channel It specifies an SSI channel to read PCM data. Choose one enumerator member from the enumerator
 * typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @param[out] pBuf It specifies the beginning address of buffer memory storing PCM data read from Receive FIFO Data
 * Register.
 * @param[in] Samples It specifies the request number of PCM data samples to read from Receive FIFO Data Register.
 * @return The number of read samples: Shows the number of PCM data samples read from Receive FIFO Data
 * Register of a specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked. Or returns
 * SSI_ERR_CHANNEL when the SSI channel is configured for transmit operation.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function to read PCM data from a specified SSI channel's Receive FIFO Data Register.
 * @note that R_SSI_Read() should be called repeatedly to read PCM data from the specified SSI channel
 * during receive operation.
 */
int8_t R_SSI_Read( const ssi_ch_t Channel,
                    void * pBuf,
                    const uint8_t Samples)
{
    int8_t ret = SSI_SUCCESS;
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;
    uint32_t fifo_filled;   /* holds the number of filled memory in Rx FIFO */
    uint32_t request;       /* holds the number of times to read-access by request.*/
    uint32_t limit;         /* holds the number of times to read-access to Rx FIFO. */
    uint32_t count = 0u;   /* The number of times Tx FIFO was accessed. */
    uint8_t word_num_per_sample;

