renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
    /* parameter check operation */
    ret = r_ssi_check_param_buf (Channel, pBuf, Samples);
    if (SSI_SUCCESS != ret)  /* parameters are valid. */
    {
        return ret;
    }

    /* read operation mainbody */
    if (SSIE_IO_MODE_TX == r_ssi_get_iomode [Channel])
    {
        return SSI_ERR_CHANNEL;
    }

    /* getting ssi register address */
    p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

    word_num_per_sample = r_ssi_get_word_num_per_sample(p_ssi_reg);

    /* Process to read PCM data from Rx FIFO */
    /* Get the number of filled memory in Rx FIFO. */
    fifo_filled = p_ssi_reg->SSIFSR.BIT.RDC;
    if (0u == fifo_filled)
    {
        /* return because Rx FIFO is empty. */
        return 0u;
    }

    /* Calculate time to read-access just corresponding to the "Samples". */
    request = ((uint32_t)Samples) * ((uint32_t)word_num_per_sample);

    /* Limit operation for times to read-accecss to Rx FIFO. */
    if (fifo_filled <= request)
    {
        /* case, the number of filled memory of FIFO is smaller than request. */
        limit = fifo_filled;
    }
    else
    {
        /* case, the number of filled memory of FIFO is larger than request. */
        limit = request;
    }

    limit = limit - (limit % word_num_per_sample);

    /* WAIT_LOOP */
    while (limit > count)
    {
        if (SSIE_SSICR_DWL08 == p_ssi_reg->SSICR.BIT.DWL)
        {
            *((uint8_t *)pBuf) = p_ssi_reg->SSIFRDR.BYTE.HH;
            pBuf = ((uint8_t *)pBuf) + 1u;
        }
        else if (SSIE_SSICR_DWL16 == p_ssi_reg->SSICR.BIT.DWL)
        {
            *((uint16_t *)pBuf) = p_ssi_reg->SSIFRDR.WORD.H;
            pBuf = ((uint16_t *)pBuf) + 1u;
        }
        else
        {
            *((uint32_t *)pBuf) = p_ssi_reg->SSIFRDR.LONG;
            pBuf = ((uint32_t *)pBuf) + 1u;
        }

        count++;
    }

    /* Clear Rx FIFO full flag */
    r_ssi_clear_flag_rdf( p_ssi_reg );

    /* Convert the number of FIFO to be plactically read
       from Rx FIFO into the number of Samples */
    ret = (int8_t)(count / word_num_per_sample);

    return ret;
}
/******************************************************************************
End of function  R_SSI_Read
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Mute
 ******************************************************************************************************************//**
 * @brief Sets or releases mute on a specified SSI channel during transmit operation.
 * During mute, the transmitting PCM data of the specified SSI channel is turned 0.
 * @param[in] Channel It specifies an SSI channel to set or release mute. Choose one enumerator member from the
 * enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @param[in] OnOff It specifies to set or release mute. Choose one enumerator member from the enumerator typedef
 * ssi_mute_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, for the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked. Or the SSI channel
 * is configured for operations other than transmit.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function to set or release mute for an SSI channel during transmit operation.
 * @note -
 */
ssi_ret_t R_SSI_Mute(const ssi_ch_t Channel, const ssi_mute_t OnOff)
{
    uint32_t timeout;
    ssi_ret_t ret = SSI_SUCCESS;
    volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;
    uint8_t word_num_per_sample;

    /* parameter check operation */
    ret = r_ssi_check_param_mute (Channel, OnOff);
    if (SSI_SUCCESS != ret)  /* parameters are valid. */
    {
        return ret;
    }

    /* mute operation mainbody */
    if (SSIE_IO_MODE_TX != r_ssi_get_iomode [Channel])
    {
    /* Error because Mute operation is available only for SSI_IO_MODE_TX. */
        return SSI_ERR_CHANNEL;
    }

    /* getting ssi register address */
    p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

    /* Start Mute operation. */
    word_num_per_sample = r_ssi_get_word_num_per_sample(p_ssi_reg);

    if (SSI_MUTE_ON == OnOff)
    {
        /* Mute on operaton (Mute assertion) */
    	if ((SSIE_SSIFCR_TIE_DISABLE == p_ssi_reg->SSIFCR.BIT.TIE) || (SSIE_SSICR_TEN_DISABLE == p_ssi_reg->SSICR.BIT.TEN))
        {
            return SSI_SUCCESS;
        }

        p_ssi_reg->SSICR.BIT.TUIEN = SSIE_SSICR_TUIEN_DISABLE;
	    p_ssi_reg->SSIFCR.BIT.TIE = SSIE_SSIFCR_TIE_DISABLE;

        /* Set LRCK/FS Continue Mode to keep LRCK/FS output */
        if (SSIE_SSICR_MST_ON == p_ssi_reg->SSICR.BIT.MST)
        {
            p_ssi_reg->SSIOFR.BIT.LRCONT = 1u;
        }

        /* WAIT_LOOP */
        while (p_ssi_reg->SSIFSR.BIT.TDC >= (SSIE_SSIFSR_TDCMAX -  word_num_per_sample))
        {
            /* Exception Check */
            if (SSIE_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ)
            {
                /* Exception Error */
                return SSI_ERR_EXCEPT;
            }
        }

        /* Write 0 to Tx FIFO */
        r_ssi_write_zero_to_tx_fifo(p_ssi_reg, (int32_t)word_num_per_sample);

        timeout = SSIE_TIMEOUT_416USEC;

        /* WAIT_LOOP */
        while (SSIE_SSISR_TUIRQ_OFF == p_ssi_reg->SSISR.BIT.TUIRQ)
        {
            /* Check loop count to detect abnormal condition. */
            timeout = r_ssi_down_count ( timeout );
            if ( 0 == timeout )
            {
                /* Return from abnormal condition. */
                return SSI_ERR_EXCEPT;
            }
        }

        /* disable SSI transmit operation */
        p_ssi_reg->SSICR.BIT.TEN = SSIE_SSICR_TEN_DISABLE;
        r_ssi_clear_flag_tuirq( p_ssi_reg );

        /* Wait operation for IIRQ to be set. */

        /* Wait until Idle mode Interrrupt status Flag to be set. */
        /* initialize timeout counter. */
        timeout = SSIE_TIMEOUT_416USEC;

        /* WAIT_LOOP */
        while ( SSIE_SSISR_IIRQ_OFF == p_ssi_reg->SSISR.BIT.IIRQ )
        {
            /* Check loop count to detect abnormal condition. */
            timeout = r_ssi_down_count ( timeout );
            if ( 0u == timeout )
            {
                /* Return from abnormal condition. */
                return SSI_ERR_EXCEPT;
            }
        }
    } /* End of Mute on process */
    else
    {
        /* Mute off operaton (Mute deassertion) */
    	if ((SSIE_SSIFCR_TIE_ENABLE == p_ssi_reg->SSIFCR.BIT.TIE) || (SSIE_SSICR_TEN_ENABLE == p_ssi_reg->SSICR.BIT.TEN))
        {
            return SSI_SUCCESS;
        }

        if ( 0u != p_ssi_reg->SSIFSR.BIT.TDC)
        {
            return SSI_ERR_EXCEPT;
        }

        /*  case Tx FIFO is empty:
            Write "0" to Tx FIFO. It requires to write 8 bytes to Tx FIFO.
        */
        r_ssi_write_zero_to_tx_fifo(p_ssi_reg, (int32_t)word_num_per_sample);

        /*  Enable transmit operation for Mute off by TEN = SSI_SSICR_TEN_ENABLE,
            When Mute was turned ON, transmit operation is desabled.
        */
        p_ssi_reg->SSICR.BIT.TEN = SSIE_SSICR_TEN_ENABLE;

        /* Wait until Idle mode Interrrupt status Flag to be set. */
        /* initialize timeout counter. */
        timeout = SSIE_TIMEOUT_416USEC;

        /* WAIT_LOOP */
        while ( SSIE_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ )
        {
            /* Check loop count to detect abnormal condition. */
            timeout = r_ssi_down_count ( timeout );
            if ( 0 == timeout )
            {
                return SSI_ERR_EXCEPT;  /* Return from abnormal condition. */
            }
        }

        /* Reset LRCK/FS Continue Mode (it should depend on config.h !!) */
        if (SSIE_SSICR_MST_ON == p_ssi_reg->SSICR.BIT.MST)
        {
            p_ssi_reg->SSIOFR.BIT.LRCONT = 0u;
        }

        /* Setting to mute off SSI Tx */
        r_ssi_clear_flag_tde( p_ssi_reg );
        r_ssi_clear_flag_tuirq( p_ssi_reg );
        p_ssi_reg->SSIFCR.BIT.TIE = SSIE_SSIFCR_TIE_ENABLE;
        p_ssi_reg->SSICR.BIT.TUIEN = SSIE_SSICR_TUIEN_ENABLE;
    }

    return SSI_SUCCESS;
}

