renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
/******************************************************************************
End of function R_SSI_ClearFlagRxUnderFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_ClearFlagRxOverFlow
 ******************************************************************************************************************//**
 * @brief Clears a specified SSI channel's ROIRQ flag of SSISR to 0.
 * @param[in] Channel It specifies an SSI channel to clear ROIRQ flag. Choose one enumerator member from the
 * enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, this function cleared the ROIRQ flag of the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to clear the ROIRQ flag when the flag is 1.
 * @note -
 */
ssi_ret_t R_SSI_ClearFlagRxOverFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag clear operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* flag clear operation */
        r_ssi_clear_flag_roirq(p_ssi_reg);
    }

    return ret;
}

/******************************************************************************
End of function R_SSI_ClearFlagRxOverFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_GetFlagTxUnderFlow
 ******************************************************************************************************************//**
 * @brief Returns a state of whether transmit underflow or not. The state is the value corresponding to a
 * specified SSI channel's TUIRQ flag of SSISR.
 * @param[in] Channel It specifies an SSI channel to get a state of the TUIRQ flag. Choose one enumerator member
 * from the enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_CLR The specified SSI channel’s TUIRQ flag is 0.
 * @retval SSI_SET The specified SSI channel’s TUIRQ flag is 1.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to read a state of the TUIRQ flag of the SSISR register of a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_GetFlagTxUnderFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag get operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* get enum member for target ssi channel. */
        if ( 0 == p_ssi_reg->SSISR.BIT.TUIRQ )
        {
            ret = SSI_FLAG_CLR; 
        }
        else
        {
            ret = SSI_FLAG_SET;
        }
    }

    return ret;
}

/******************************************************************************
End of function  R_SSI_GetFlagTxUnderFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_GetFlagTxOverFlow
 ******************************************************************************************************************//**
 * @brief Returns a state of whether transmit overflow occurs or not. The state is the value corresponding to a
 * specified SSI channel's TOIRQ flag of SSISR.
 * @param[in] Channel It specifies an SSI channel to get a state of the TOIRQ flag. Choose one enumerator member
 * from the enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_CLR The specified SSI channel’s TOIRQ flag is 0.
 * @retval SSI_SET The specified SSI channel’s TOIRQ flag is 1.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to read a state of the TOIRQ flag of the SSISR register of a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_GetFlagTxOverFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag get operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* get enum member for target ssi channel. */
        if ( 0 == p_ssi_reg->SSISR.BIT.TOIRQ )
        {
            ret = SSI_FLAG_CLR; 
        }
        else
        {
            ret = SSI_FLAG_SET;
        }
    }

    return ret;
}

/******************************************************************************
End of function  R_SSI_GetFlagTxOverFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_GetFlagRxUnderFlow
 ******************************************************************************************************************//**
 * @brief Returns a state of whether receive underflow occurs or not. The state is the value corresponding to a
 * specified SSI channel's RUIRQ flag of SSISR.
 * @param[in] Channel It specifies an SSI channel to get a state of the RUIRQ flag. Choose one enumerator member
 * from the enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_CLR The specified SSI channel’s RUIRQ flag is 0.
 * @retval SSI_SET The specified SSI channel’s RUIRQ flag is 1.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to read a state of the RUIRQ flag of the SSISR register of a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_GetFlagRxUnderFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag get operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

