renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssie_api_rx.c
        /* get enum member for target ssi channel. */
        if ( 0 == p_ssi_reg->SSISR.BIT.RUIRQ )
        {
            ret = SSI_FLAG_CLR; 
        }
        else
        {
            ret = SSI_FLAG_SET;
        }
    }

    return ret;
}

/******************************************************************************
End of function  R_SSI_GetFlagRxUnderFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_GetFlagRxOverFlow
 ******************************************************************************************************************//**
 * @brief Returns a state of whether receive overflow occurs or not. The state is the value corresponding to a
 * specified SSI channel's ROIRQ flag of SSISR.
 * @param[in] Channel It specifies an SSI channel to get a state of the ROIRQ flag. Choose one enumerator member
 * from the enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_CLR The specified SSI channel’s ROIRQ flag is 0.
 * @retval SSI_SET The specified SSI channel’s ROIRQ flag is 1.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to read a state of the ROIRQ flag of the SSISR register of a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_GetFlagRxOverFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag get operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssie R_SSIE_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssie R_SSIE_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* get enum member for target ssi channel. */
        if ( 0 == p_ssi_reg->SSISR.BIT.ROIRQ )
        {
            ret = SSI_FLAG_CLR; 
        }
        else
        {
            ret = SSI_FLAG_SET;
        }
    }

    return ret;
}

/******************************************************************************
End of function R_SSI_GetFlagRxOverFlow
******************************************************************************/
#endif
/* End of file */
